# TODO

""""
تابعی بنویسید که یک لیست را بگیرد و بزرگترین و نیز کوچکترین عدد را برگرداند
"""
"""
حاصل جمع
calculateSum([2,4,6,8,10])  =>    30

حاصلضرب
calculateProduct([2,4,6,8,10])  =>    3840


"""


"""
تابعی بنویسید که یک لیست را بگیرد و میانگین اعداد آن را محاسبه نماید
میانگین یعنی جمع اعداد تقسیم بر تعدادشان

"""

"""
برنامه ای بنویسید که لیستی از اعداد را بگیرد و
عدد وسط را نمایش دهد

[3,7,10,4,1,6,9,2,8]
اول باید لیست را مرتب کند و سپس عدد وسط را بدهد

[1,2,3,4,6,7,8,9,10]   => 6

"""
"""
تابعی بنویسید که لیستی از اعداد را بگیرد و عددی که بیشترین تکرار را دارد نمایش دهد

[1,1,2,3,4]  => 1

"""